In [0]:
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

In [0]:
data = pd.read_csv('titanic.csv')

In [0]:
data.shape

(891, 12)

In [0]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [0]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [0]:
cols_to_drop = ['PassengerId','Name','Ticket','Cabin','Embarked']
data = data.drop(cols_to_drop, axis=1)

print(data.columns)
data.head()

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [0]:
# Drop rows that contain NaN (Mostly in the 'Age' column)

print(data.values.shape)
r_old = data.values.shape[0]

data = data.dropna(axis=0)
print(data.values.shape)
r_new = data.values.shape[0]

print(f'{r_old-r_new} rows dropped')

(891, 7)
(714, 7)
177 rows dropped

In [0]:
sex_mapping = {
    'male' : 0,
    'female': 1,
}
data.Sex = data.Sex.map(sex_mapping)

data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250
3         1       1    1  35.0      1      0  53.1000
4         0       3    0  35.0      0      0   8.0500

In [0]:
data = data.values

## Split into Test and Training
split = int(0.80*data.shape[0])

X_train = data[:split,1:]
X_test = data[split:, 1:]

Y_train = data[:split, 0]
Y_test = data[split:, 0]

print(X_train.shape)
print(X_test.shape)

print(Y_train.shape)
print(Y_test.shape)

(571, 6)
(143, 6)
(571,)
(143,)

In [0]:
from sklearn.linear_model import LogisticRegression
logreg=LogisticRegression()
clf = LogisticRegression(solver='lbfgs').fit(X_train, Y_train)

In [0]:
counter=0
ans=clf.predict(X_test)
for i in range(len(ans)):
    if ans[i]==1:
        counter+=1
print(counter)
print(len(ans))

54
143

In [0]:
clf.score(X_test, Y_test)*100

81.81818181818183